[
  {
    "module_title": "Módulo 1: Fundamentos de Programação",
    "module_description": "Neste módulo, você aprenderá os conceitos básicos de programação.",
    "aulas": [
      {
        "title": "Aula 1: Configurando ambiente",
        "description": "Nesta aula você irá configurar o ambiente e ter seu primeiro contato com a linguagem.",
        "link": "modulos/modulo1/aula1.html"
      },
      {
        "title": "Aula 2: Variáveis",
        "description": "Nesta aula você irá aprender alguns conceitos de variáveis e como elas se comportam no JavaScript.",
        "link": "modulos/modulo1/aula2.html"
      },
      {
        "title": "Aula 3: Tipos de Dados",
        "description": "Nesta aula, você irá explorar os diferentes tipos de dados no JavaScript e aprender a manipular strings de forma eficiente.",
        "link": "modulos/modulo1/aula3.html"
      },
      {
        "title": "Aula 4: Números e Operadores",
        "description": "Nesta aula, você irá aprender sobre números e operadores em JavaScript, explorando como realizar operações matemáticas e manipular dados numéricos.",
        "link": "modulos/modulo1/aula4.html"
      },
      {
        "title": "Aula 5: Condicionais e Booleans",
        "description": "Nesta aula, você irá aprender sobre estruturas condicionais e booleans, incluindo if, else, switch, operadores lógicos e valores truthy e falsy.",
        "link": "modulos/modulo1/aula5.html"
      },
      {
        "title": "Aula 6: Funções em JavaScript",
        "description": "Nesta aula, você irá aprender sobre funções em JavaScript, como criar, utilizar e retornar valores, além de conceitos como escopo, hoisting e callbacks.",
        "link": "modulos/modulo1/aula6.html"
      },
      {
        "title": "Aula 7: Objetos em JavaScript",
        "description": "Nesta aula, você irá aprender sobre objetos em JavaScript, incluindo como criar, acessar e manipular propriedades e métodos, além de conceitos como protótipos e herança.",
        "link": "modulos/modulo1/aula7.html"
      },
      {
        "title": "Aula de Apoio (Aula 7): Introdução ao DOM",
        "description": "Nesta aula de apoio, você será introduzido ao DOM no contexto de como ele representa a estrutura da página e como JavaScript pode interagir com elementos HTML.",
        "link": "modulos/modulo1/aula7_apoio.html"
      },
      {
        "title": "Aula 8: Arrays e Loops em JavaScript",
        "description": "Nesta aula, você irá aprender sobre arrays e loops, explorando métodos úteis e estruturas de repetição para manipular coleções de dados.",
        "link": "modulos/modulo1/aula8.html"
      }
    ]
  },
  {
    "module_title": "Módulo 2: Estruturas de Controle",
    "module_description": "Neste módulo, você aprenderá sobre estruturas de controle de fluxo.",
    "aulas": []
  }
]
